#Найти произведение всех целых чисел от 1 до 10 включительно.

# TODO завести счетчик для произведения
# TODO посчитать произведение чисел
a = 1
for i in range (1, 11):
    a = a * i
print(a)
